### 1. Combine and Clean the Data
#### Import CSVs

In [24]:
# Import Libraries and Dependencies
import pandas as pd

In [25]:
# Read the CSV files into DataFrames.

df1 = pd.read_csv('Resources/athletic_sales_2020.csv')

df2 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [26]:
# Display the 2020 sales DataFrame
import pandas as pd



print(df1)

         retailer  retailer_id invoice_date     region         state  \
0     Foot Locker      1185732       1/1/20  Northeast      New York
1     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3     Foot Locker      1185732       1/1/20  Northeast      New York
4     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
...           ...          ...          ...        ...           ...
1292    West Gear      1128299     12/30/20       West    California
1293    West Gear      1128299     12/30/20       West    California
1294       Kohl's      1189833     12/30/20    Midwest     Minnesota
1295       Kohl's      1189833     12/30/20    Midwest     Minnesota
1296    West Gear      1128299     12/30/20       West    California

               city                  product  price_per_unit  units_sold  \
0          New York    Men's Street Footwear              50        1200
1      Philadelphia          Women's Apparel              68          83
2      Philadelphia          Women's Apparel              75         275
3          New York    Men's Street Footwear              34         384
4      Philadelphia          Women's Apparel              53          83
...             ...                      ...             ...         ...
1292  San Francisco          Women's Apparel              72         203
1293  San Francisco          Women's Apparel              80         700
1294    Minneapolis  Women's Street Footwear              41         119
1295    Minneapolis  Women's Street Footwear              45         475
1296  San Francisco          Women's Apparel              62         245

      total_sales  operating_profit sales_method
0          600000         300000.00     In-store
1            5644           2426.92       Online
2          206250          61875.00       Outlet
3           13056           6789.12       Outlet
4            4399           1407.68       Outlet
...           ...               ...          ...
1292        14616           3946.32       Online
1293       560000          84000.00       Outlet
1294         4879           2878.61       Online
1295       213750          96187.50       Outlet
1296        15190           2886.10       Outlet

[1297 rows x 12 columns]

In [27]:
# Display the 2021 sales DataFrame

print(df2)

         retailer  retailer_id invoice_date     region         state  \
0       West Gear      1128299       1/1/21       West    California
1       West Gear      1128299       1/1/21       West    California
2          Kohl's      1189833       1/1/21    Midwest       Montana
3          Kohl's      1189833       1/1/21    Midwest       Montana
4       West Gear      1128299       1/1/21       West    California
...           ...          ...          ...        ...           ...
8341  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
8342  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
8343       Amazon      1185732     12/31/21  Northeast         Maine
8344       Amazon      1185732     12/31/21  Northeast         Maine
8345  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania

               city                  product  price_per_unit  units_sold  \
0     San Francisco  Men's Athletic Footwear              65         750
1     San Francisco  Men's Athletic Footwear              51         233
2          Billings            Men's Apparel              50         275
3          Billings            Men's Apparel              47          77
4     San Francisco  Men's Athletic Footwear              64         225
...             ...                      ...             ...         ...
8341   Philadelphia            Men's Apparel              63          47
8342   Philadelphia            Men's Apparel              46          56
8343       Portland            Men's Apparel              52          36
8344       Portland            Men's Apparel              55         125
8345   Philadelphia            Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          487500         121875.00       Outlet
1           11883           3208.41       Outlet
2          137500          82500.00       Outlet
3            3619           2714.25       Online
4           14400           5184.00       Online
...           ...               ...          ...
8341         2961           1362.06       Online
8342         2576           1004.64       Outlet
8343         1872            692.64       Online
8344        68750          17187.50       Outlet
8345       122500          42875.00       Outlet

[8346 rows x 12 columns]

#### Check the data types of each DataFrame

In [28]:
# Check the 2020 sales data types.

print(df1.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [29]:
# Check the 2021 sales data types.

print(df2.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [30]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.

df_combined = pd.concat([df1, df2])

df_combined_reset = df_combined.reset_index(drop=True)

print(df_combined_reset)

         retailer  retailer_id invoice_date     region         state  \
0     Foot Locker      1185732       1/1/20  Northeast      New York
1     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3     Foot Locker      1185732       1/1/20  Northeast      New York
4     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
...           ...          ...          ...        ...           ...
9638  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
9639  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
9640       Amazon      1185732     12/31/21  Northeast         Maine
9641       Amazon      1185732     12/31/21  Northeast         Maine
9642  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania

              city                product  price_per_unit  units_sold  \
0         New York  Men's Street Footwear              50        1200
1     Philadelphia        Women's Apparel              68          83
2     Philadelphia        Women's Apparel              75         275
3         New York  Men's Street Footwear              34         384
4     Philadelphia        Women's Apparel              53          83
...            ...                    ...             ...         ...
9638  Philadelphia          Men's Apparel              63          47
9639  Philadelphia          Men's Apparel              46          56
9640      Portland          Men's Apparel              52          36
9641      Portland          Men's Apparel              55         125
9642  Philadelphia          Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          600000         300000.00     In-store
1            5644           2426.92       Online
2          206250          61875.00       Outlet
3           13056           6789.12       Outlet
4            4399           1407.68       Outlet
...           ...               ...          ...
9638         2961           1362.06       Online
9639         2576           1004.64       Outlet
9640         1872            692.64       Online
9641        68750          17187.50       Outlet
9642       122500          42875.00       Outlet

[9643 rows x 12 columns]

In [31]:
# Check if any values are null.

df_combined_reset.isnull()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
9638,False,False,False,False,False,False,False,False,False,False,False,False
9639,False,False,False,False,False,False,False,False,False,False,False,False
9640,False,False,False,False,False,False,False,False,False,False,False,False
9641,False,False,False,False,False,False,False,False,False,False,False,False
9642,False,False,False,False,False,False,False,False,False,False,False,False

In [32]:
# Check the data type of each column

df_combined_reset.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [33]:
# Convert the "invoice_date" to a datetime datatype

df_combined_reset['invoice_date'] = pd.to_datetime

In [34]:
# Confirm that the "invoice_date" data type has been changed.

print(df_combined_reset['invoice_date'].dtype)

object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [92]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold". \

import pandas as pd 

df_combined_reset.groupby(['region', 'state', 'city']).sum = pd.DataFrame

print(df_combined_reset)

df_combined_reset = df_combined_reset.rename(columns={'products_sold': 'Total Products Sold'})











# Show the top 5 results.

print(df_combined_reset.head())

TypeError: You have to supply one of 'by' and 'level'

#### Using `pivot_table`

In [134]:
# Show the number products sold for region, state, and city.

import pandas as pd 

pivot_table_productsold = pd.pivot_table(df_combined,
                                         values = 'units_sold',
                                         index=['region', 'state', 'city'],
                                         aggfunc='sum').reset_index()

pivot_table_productsold





# Rename the "units_sold" column to "Total_Products_Sold"

pivot_table_productsold = pivot_table_productsold.rename(column={'units_sold' : 'Total_Products_Sold'})


# Show the top 5 results.

print(pivot_table.head(5))

TypeError: DataFrame.rename() got an unexpected keyword argument 'column'

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [155]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"

total_sales = df_combined.groupby(['region', 'state', 'city'])['total_sales'].sum().reset_index()

total_sales = total_sales.rename(columns={'total_sales': 'Total Sales'})




# Show the top 5 results.

print(total_sales.head(5))

    region     state          city  Total Sales
0  Midwest  Illinois       Chicago      9797488
1  Midwest   Indiana  Indianapolis      8836198
2  Midwest      Iowa    Des Moines      7424011
3  Midwest    Kansas       Wichita      9972864
4  Midwest  Michigan       Detroit     18625433

#### Using `pivot_table`

In [174]:
# Show the total sales for the products sold for each region, state, and city.

pivot_table_totalsales = pd.pivot_table(df_combined, 
                             values='total_sales', 
                             index=['region', 'state', 'city'],  
                             aggfunc='sum').reset_index()

# Optional: Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.

print(pivot_table_totalsales.head(5))

    region     state          city  total_sales
0  Midwest  Illinois       Chicago      9797488
1  Midwest   Indiana  Indianapolis      8836198
2  Midwest      Iowa    Des Moines      7424011
3  Midwest    Kansas       Wichita      9972864
4  Midwest  Michigan       Detroit     18625433

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [199]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"

grouped_df_retailer = df_combined.groupby(['retailer', 'region', 'state', 'city'])['total_sales'].sum().reset_index()

grouped_df_retailer = grouped_df_retailer.rename(columns={'total_sales': 'Total Sales'})

# Show the top 5 results.

print(grouped_df_retailer.head(5))

  retailer     region          state        city  Total Sales
0   Amazon    Midwest           Ohio    Columbus     16835873
1   Amazon  Northeast          Maine    Portland      8611395
2   Amazon  Northeast  Massachusetts      Boston      4193590
3   Amazon  Northeast  New Hampshire  Manchester     10077142
4   Amazon  Northeast        Vermont  Burlington     13380463

#### Using `pivot_table`

In [207]:
# Show the total sales for the products sold for each retailer, region, state, and city.

pivot_table_retailer = pd.pivot_table(df_combined, 
                             values='total_sales',  # The column to aggregate
                             index=['retailer', 'region', 'state', 'city'],  # Group by these columns
                             aggfunc='sum').reset_index()  # Aggregate by sum and reset index

# Rename 'total_sales' to 'Total Sales'
pivot_table_retailer = pivot_table_retailer.rename(columns={'total_sales': 'Total Sales'})

# Display the result
print(pivot_table)

# Optional: Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.

       region           state            city  total_sales
0     Midwest        Illinois         Chicago      9797488
1     Midwest         Indiana    Indianapolis      8836198
2     Midwest            Iowa      Des Moines      7424011
3     Midwest          Kansas         Wichita      9972864
4     Midwest        Michigan         Detroit     18625433
5     Midwest       Minnesota     Minneapolis      7227506
6     Midwest        Missouri       St. Louis      9683265
7     Midwest         Montana        Billings     15710886
8     Midwest        Nebraska           Omaha      5929038
9     Midwest    North Dakota           Fargo      7735580
10    Midwest            Ohio        Columbus     18484583
11    Midwest    South Dakota     Sioux Falls      8495576
12    Midwest       Wisconsin       Milwaukee      7727469
13  Northeast     Connecticut        Hartford     11573448
14  Northeast        Delaware      Wilmington     12298412
15  Northeast           Maine        Portland      9195978
16  Northeast        Maryland       Baltimore      7758059
17  Northeast   Massachusetts          Boston     11076810
18  Northeast   New Hampshire      Manchester     16411667
19  Northeast      New Jersey          Newark      9934246
20  Northeast        New York          Albany     24427804
21  Northeast        New York        New York     39801235
22  Northeast    Pennsylvania    Philadelphia     10357519
23  Northeast    Rhode Island      Providence      8446806
24  Northeast         Vermont      Burlington     14352923
25  Northeast   West Virginia      Charleston     10689160
26      South         Alabama      Birmingham     17633424
27      South        Arkansas     Little Rock     12639347
28      South       Louisiana     New Orleans     23750781
29      South     Mississippi         Jackson     15591709
30      South        Oklahoma   Oklahoma City     10620734
31      South       Tennessee       Knoxville     18067440
32      South           Texas          Dallas     20902864
33      South           Texas         Houston     25456882
34  Southeast         Florida           Miami     31600863
35  Southeast         Florida         Orlando     27682851
36  Southeast         Georgia         Atlanta     18997466
37  Southeast        Kentucky      Louisville     10072848
38  Southeast  North Carolina       Charlotte     23956531
39  Southeast  South Carolina      Charleston     29285637
40  Southeast        Virginia        Richmond     21575040
41       West          Alaska       Anchorage     14753103
42       West         Arizona         Phoenix     15782221
43       West      California     Los Angeles     25634913
44       West      California   San Francisco     33973228
45       West        Colorado          Denver     20996536
46       West          Hawaii        Honolulu     22282457
47       West           Idaho           Boise     19276878
48       West          Nevada       Las Vegas     20858509
49       West      New Mexico     Albuquerque     19865016
50       West          Oregon        Portland     21349674
51       West            Utah  Salt Lake City      9696420
52       West      Washington         Seattle     26330718
53       West         Wyoming        Cheyenne     18577517

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [208]:
# Filter the sales data to get the women's athletic footwear sales data.

#### Using `groupby`

In [209]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"


# Show the top 5 results.

#### Using `pivot_table`

In [210]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"


# Show the top 5 results.

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [211]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.


# Optional: Rename the "total_sales" column to "Total Sales"


# Show the table.

In [212]:
# Resample the pivot table into daily bins, and get the total sales for each day.


# Sort the resampled pivot table in descending order on "Total Sales".

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [213]:
# Resample the pivot table into weekly bins, and get the total sales for each week.


# Sort the resampled pivot table in descending order on "Total Sales".